src/test/jmeter/jmeter-reports/vets/html/statistics.json
{
  "DELETE /vets/{id}" : {
    "transaction" : "DELETE /vets/{id}",
    "sampleCount" : 61,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 82.6065573770492,
    "medianResTime" : 81.0,
    "minResTime" : 74.0,
    "maxResTime" : 119.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 100.5,
    "pct3ResTime" : 119.0,
    "throughput" : 0.9406177237051087,
    "receivedKBytesPerSec" : 0.33160449048588303,
    "sentKBytesPerSec" : 0.23193189966230282
  },
  "GET /vets/{id}" : {
    "transaction" : "GET /vets/{id}",
    "sampleCount" : 61,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 80.93442622950816,
    "medianResTime" : 81.0,
    "minResTime" : 73.0,
    "maxResTime" : 99.0,
    "pct1ResTime" : 88.0,
    "pct2ResTime" : 91.69999999999999,
    "pct3ResTime" : 99.0,
    "throughput" : 0.9386781564976534,
    "receivedKBytesPerSec" : 0.4550930022312841,
    "sentKBytesPerSec" : 0.21128673924751867
  },
  "GET /vets/{id} (after delete)" : {
    "transaction" : "GET /vets/{id} (after delete)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 86.0,
    "medianResTime" : 86.0,
    "minResTime" : 86.0,
    "maxResTime" : 86.0,
    "pct1ResTime" : 86.0,
    "pct2ResTime" : 86.0,
    "pct3ResTime" : 86.0,
    "throughput" : 11.627906976744185,
    "receivedKBytesPerSec" : 4.315043604651163,
    "sentKBytesPerSec" : 2.6117369186046515
  },
  "PUT /vets/{id}" : {
    "transaction" : "PUT /vets/{id}",
    "sampleCount" : 61,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.90163934426232,
    "medianResTime" : 83.0,
    "minResTime" : 76.0,
    "maxResTime" : 109.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 101.6,
    "pct3ResTime" : 109.0,
    "throughput" : 0.9400958589547983,
    "receivedKBytesPerSec" : 0.3607985083683943,
    "sentKBytesPerSec" : 0.3106512331052445
  },
  "GET /vets (list)" : {
    "transaction" : "GET /vets (list)",
    "sampleCount" : 140,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.6785714285714,
    "medianResTime" : 82.0,
    "minResTime" : 75.0,
    "maxResTime" : 155.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 102.0,
    "pct3ResTime" : 139.83000000000013,
    "throughput" : 2.089053360391548,
    "receivedKBytesPerSec" : 2.1451121513892204,
    "sentKBytesPerSec" : 0.46310069610242327
  },
  "GET /vets (read-only)" : {
    "transaction" : "GET /vets (read-only)",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.77333333333338,
    "medianResTime" : 83.0,
    "minResTime" : 75.0,
    "maxResTime" : 162.0,
    "pct1ResTime" : 92.0,
    "pct2ResTime" : 99.89999999999998,
    "pct3ResTime" : 134.97000000000048,
    "throughput" : 2.4997916840263312,
    "receivedKBytesPerSec" : 2.57698251708191,
    "sentKBytesPerSec" : 0.5541530393300558
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 538,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.52602230483278,
    "medianResTime" : 82.0,
    "minResTime" : 9.0,
    "maxResTime" : 162.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 99.04999999999995,
    "pct3ResTime" : 118.61000000000001,
    "throughput" : 8.020752579163933,
    "receivedKBytesPerSec" : 6.0546263520111525,
    "sentKBytesPerSec" : 1.9874115508900354
  },
  "GET /vets (auth)" : {
    "transaction" : "GET /vets (auth)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 136.0,
    "medianResTime" : 136.0,
    "minResTime" : 136.0,
    "maxResTime" : 136.0,
    "pct1ResTime" : 136.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 136.0,
    "throughput" : 7.352941176470588,
    "receivedKBytesPerSec" : 7.388844209558823,
    "sentKBytesPerSec" : 1.6299977022058822
  },
  "GET /vets/{id} (after update)" : {
    "transaction" : "GET /vets/{id} (after update)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 91.0,
    "medianResTime" : 91.0,
    "minResTime" : 91.0,
    "maxResTime" : 91.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 91.0,
    "pct3ResTime" : 91.0,
    "throughput" : 10.989010989010989,
    "receivedKBytesPerSec" : 5.601820054945055,
    "sentKBytesPerSec" : 2.46823489010989
  },
  "POST /vets" : {
    "transaction" : "POST /vets",
    "sampleCount" : 61,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.44262295081965,
    "medianResTime" : 82.0,
    "minResTime" : 74.0,
    "maxResTime" : 135.0,
    "pct1ResTime" : 94.20000000000002,
    "pct2ResTime" : 101.5,
    "pct3ResTime" : 135.0,
    "throughput" : 0.9374519747963731,
    "receivedKBytesPerSec" : 0.47692028776702017,
    "sentKBytesPerSec" : 0.2956401519517443
  },
  "GET /vets (unauth)" : {
    "transaction" : "GET /vets (unauth)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.0,
    "medianResTime" : 9.0,
    "minResTime" : 9.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 111.1111111111111,
    "receivedKBytesPerSec" : 35.80729166666667,
    "sentKBytesPerSec" : 20.399305555555557
  }
}